Tekla.Structures.Model.UI.View
The View class contains methods related to views.
An example of using the View and ViewHandler classes:
using System;
using Tekla.Structures.Model.UI;
using Tekla.Structures.Geometry3d;
public class ViewExample
{
public void ViewExample1()
{
View View = new View();
View.Name = "Example View";
View.ViewCoordinateSystem.AxisX = new Vector(1, 0, 0);
View.ViewCoordinateSystem.AxisY = new Vector(0, 1, 0);
// Work area has to be set for new views
View.WorkArea.MinPoint = new Point(-3000, -3000, -3000);
View.WorkArea.MaxPoint = new Point(15000, 33000, 12000);
View.ViewDepthUp = 10000;
View.ViewDepthDown = 2000;
View.Insert();
View.WorkArea.MinPoint = new Point(-3000, -3000, -3000);
View.WorkArea.MaxPoint = new Point(5000, 3000, 2000);
View.Modify();
}
}
using Tekla.Structures.Model.UI;
public class Example
{
public void Example1()
{
ModelViewEnumerator ViewEnum = ViewHandler.GetAllViews();
while(ViewEnum.MoveNext())
{
View View = ViewEnum.Current;
ViewHandler.HideView(View);
}
}
}

Tekla.Structures.Model.UI.View.CurrentRepresentation
Gets or sets the current representation.

Tekla.Structures.Model.UI.View.Identifier
The view identifier.

Tekla.Structures.Model.UI.View.ViewCoordinateSystem
The local coordinate system for the view.
Can be set when creating a view.
The origin is always set to zero.

Tekla.Structures.Model.UI.View.DisplayCoordinateSystem
The local coordinate system for the display.

Tekla.Structures.Model.UI.View.Name
The name of the view. 84 characters at most.

Tekla.Structures.Model.UI.View.WorkArea
The view working area.

Tekla.Structures.Model.UI.View.ViewDepthUp
The view depth up.

Tekla.Structures.Model.UI.View.ViewDepthDown
The view depth down.

Tekla.Structures.Model.UI.View.ViewProjection
The view projection type.

Tekla.Structures.Model.UI.View.DisplayType
The display plane type.

Tekla.Structures.Model.UI.View.ViewRendering
The view rendering type.

Tekla.Structures.Model.UI.View.ViewFilter
The name of the view filter. 256 characters at most.

Tekla.Structures.Model.UI.View.SharedView
The property which tells if the view is shared.
The value is meaningful only when the model is shared.

Tekla.Structures.Model.UI.View.VisibilitySettings
The property which tells the view visibility settings for objects.

Tekla.Structures.Model.UI.View.Insert
Inserts a new view to the model.
Returns: True if the operation was successful.

Tekla.Structures.Model.UI.View.Modify
Modifies the view parameters.
Returns: True if the operation was successful.

Tekla.Structures.Model.UI.View.Select
Selects the view.
Returns: True if the operation was successful.

Tekla.Structures.Model.UI.View.Delete
Deletes the view.
Returns: True if the operation was successful.

Tekla.Structures.Model.UI.View.IsPerspectiveViewProjection
Tells whether the view projection is a perspective projection.
Returns: True if the view projection type is perspective projection.

Tekla.Structures.Model.UI.View.IsVisible
Tells whether the view is currently visible.
Returns: True if the view is visible.

Tekla.Structures.Model.UI.View.GetClipPlanes
Returns all the clip planes of the view.
Returns: The clip planes of the view.
The following example shows how all ClipPlanes are deleted from the first visible view:
using System;
using System.Collections;
using Tekla.Structures.Model.UI;
using Tekla.Structures.Geometry3d;
public class GetClipPlanesExample
{
public void GetClipPlanesExample1()
{
ModelViewEnumerator ViewEnum = ViewHandler.GetVisibleViews();
ViewEnum.MoveNext();
View ActiveView = ViewEnum.Current;
ClipPlaneCollection ClipPlanes = ActiveView.GetClipPlanes();
if (ClipPlanes.Count > 0)
{
IEnumerator PlaneEnum = ClipPlanes.GetEnumerator();
while (PlaneEnum.MoveNext())
{
ClipPlane CPlane = PlaneEnum.Current as ClipPlane;
if (CPlane != null)
CPlane.Delete();
}
}
}
}

Tekla.Structures.Model.UI.View.Insert(System.Boolean,System.Boolean)
Inserts a new view to the model.
openView: A value indicating whether to open the inserted view
useAppliedValues: A value indicating whether to use applied values.
Returns:
True if the operation was successful.

Tekla.Structures.Model.UI.View.InsertInstance(System.Boolean,System.Boolean)
Inserts view instance to model
openView: A value indicating whether to open the inserted view
useAppliedValues: A value indicating whether to use applied values.
Returns:
true if new view was inserted

Tekla.Structures.Model.UI.View.ModifyInstance
Modifies selected view
Returns:  true if view was succesfully updated

Tekla.Structures.Model.UI.View.DeleteInstance
Deletes selected view from database
Returns:  true if view was deleted

Tekla.Structures.Model.UI.View.SelectInstance
Selects view from model
Returns:  true if given view was selected